// Задача 13: Напишите программу, которая выводит
// третью цифру заданного числа или сообщает, что третьей
// цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.WriteLine("Покажу вам третью цифру числа, которое вы введете.");
Console.WriteLine("Введите число");
int userNumber = Convert.ToInt32(Console.ReadLine());
string anyNumberText = Convert.ToString(userNumber);
if (anyNumberText.Length > 2){
  Console.WriteLine("третья цифра -> " + anyNumberText[2]);
}
else {
  Console.WriteLine("-> третьей цифры нет");
}